app/controllers/comments_controller.rb

  def show_comments
	@comments = Comment.find_by_post_id(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 3 LIMIT 1