app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "message", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 29 Jan 2013 16:10:36 UTC +00:00], ["message", nil], ["title", nil], ["updated_at", Tue, 29 Jan 2013 16:10:36 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "message" = 'Test texttttt', "updated_at" = '2013-01-29 16:24:58.822110' WHERE "posts"."id" = 3